---
kind: other
id: Methods.T:Autodesk.Revit.DB.PolylineSegments
source: html/1e385ab0-0e7d-aba2-7d76-b0fe718151aa.htm
---
# PolylineSegments Methods

Returns an array of vertices of the polyline segments.